content/posts/Process_Metaphysics_An_introduction_to_process_philosophy_by_Nicholas_Rescher_in_1996.md
+++
title = "Process Metaphysics An introduction to process philosophy by Nicholas Rescher in 1996"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:39-04:00
slug = "Process_Metaphysics_An_introduction_to_process_philosophy_by_Nicholas_Rescher_in_1996"
draft = false
+++

## [philosophy]({{< relref "philosophy" >}}), [process philosophy]({{< relref "process_philosophy" >}}), [books]({{< relref "books" >}}), [Nicholas Rescher]({{< relref "Nicholas_Rescher" >}}) {#philosophy--philosophy-dot-md--process-philosophy--process-philosophy-dot-md--books--books-dot-md--nicholas-rescher--nicholas-rescher-dot-md}


## contents {#contents}


### 1. Historical Background {#1-dot-historical-background}

<!--list-separator-->

-  1. Prospect

<!--list-separator-->

-  2. Heraclitus (6th Century B.C.)

<!--list-separator-->

-  3. Plato and Aristotle

<!--list-separator-->

-  4. Gottfried Wilhelm Leibniz (16461717)

<!--list-separator-->

-  5. Georg Wilhelm Friedrich Hegel (17701831)

<!--list-separator-->

-  6. Charles Sanders Peirce (18391914)

<!--list-separator-->

-  7. William James (18421910)

<!--list-separator-->

-  8. Henri Bergson (18591941)

<!--list-separator-->

-  9. John Dewey (18591952)

<!--list-separator-->

-  10. Alfred North Whitehead (18611947)

<!--list-separator-->

-  11. Wilmon H. Sheldon (18751981)


### 2. Basic Ideas {#2-dot-basic-ideas}

<!--list-separator-->

-  1. The Process Approach and Its Alternatives

<!--list-separator-->

-  2. Key Concepts and Categories

<!--list-separator-->

-  3. What Is a Process?

<!--list-separator-->

-  4. Modes of Process

<!--list-separator-->

-  5. The Priority of Process: Against the Process Reducibility Thesis

<!--list-separator-->

-  6. Processes and Dispositions


### 3. Process and Particulars {#3-dot-process-and-particulars}

<!--list-separator-->

-  1. Particulars

<!--list-separator-->

-  2. Complexification

<!--list-separator-->

-  3. Ongoing Identity as a Matter of Ongoing Reidentifiability: An Idealistic Perspective

<!--list-separator-->

-  4. Against Strawson's Critique of Processism

<!--list-separator-->

-  5. Difficulties of Substantialism

<!--list-separator-->

-  6. The Origination of Particulars


### 4. Process and Universals {#4-dot-process-and-universals}

<!--list-separator-->

-  1. Process and "The Problem of Universals"

<!--list-separator-->

-  2. Novelty, Innovation, Creativity

<!--list-separator-->

-  3. Taxonomic Complexification


### 5. Process Philosophy of Nature {#5-dot-process-philosophy-of-nature}

<!--list-separator-->

-  1. Basic Ideas of a Process Philosophy of Nature

<!--list-separator-->

-  2. Process and Existence

<!--list-separator-->

-  3. Process and the Laws of Nature

<!--list-separator-->

-  4. Space-Time

<!--list-separator-->

-  5. The Quantum Aspect

<!--list-separator-->

-  6. Process Philosophy and Evolutionary Optimism

<!--list-separator-->

-  7. Validation


### 6. Process and Persons {#6-dot-process-and-persons}

<!--list-separator-->

-  1. Difficulties of the Self and the Process Approach to Persons

<!--list-separator-->

-  2. Mind and Matter in Processual Perspective

<!--list-separator-->

-  3. Human Life as a Process: The General Idea of a Life Cycle

<!--list-separator-->

-  4. Historical Process

<!--list-separator-->

-  5. Transiency and Value


### 7. Process Logic and Epistemology {#7-dot-process-logic-and-epistemology}

<!--list-separator-->

-  1. Truth and Knowledge: The Processual Perspective

<!--list-separator-->

-  2. Aristotle and Truth-Value Indeterminacy

<!--list-separator-->

-  3. The Processual Nature of Knowledge and the Cognitive Inexhaustibility of Things

<!--list-separator-->

-  4. Process and Experience

<!--list-separator-->

-  5. Process and Communication
